import jieba

print("你好！\n有什麼社交上的困擾嗎？")
s = input()

words = jieba.cut(s)

reply = []
ans = 0


stopwords = {}.fromkeys([line.rstrip() for line in open('stopWords.txt', encoding='utf8')])

for word in words:
    if word not in stopwords:
        reply.append(word)
print(reply)


pattern1 = [
    ('知道', '同學聊'), ('知道', '新', '同學', '說'), ('知道', '新', '同學聊'),
    ('知道', '同學', '說'), ('新', '同學聊'), ('新', '同學', '說'), ('生話題', '聊天'),
    '同學聊', ('同學', '說'), '聊什麼', '說', ('開', '啟話題'), ('開啟', '話題'),
    ('開啟', '新話題'), ('同學聊', '話題'), ('聊什麼', '話題'), ('有什麼', '話題', '聊'),
    ('想', '聊天', ' ', '做', '朋友'), ('知道', '說'), ('有什麼', '聊'), ('給我', '一個', '話題'),
    ('幫', '想', '一個', '話題'), ('有什麼', '話', '新', '同學', '說'), ('知道', '朋友', '聊什麼'),
    ('朋友', '聊什麼'), ('朋友', '說'), ('朋友', '聊什麼', '話題'), ('新', '朋友', '說'),
    ('有什麼', '話', '新', '朋友', '說'),
    ]

pattern2 = [
    ('新', '同學', '相處'), ('新', '朋友', '相處'), ('同學', '相處'), ('朋友', '相處'),
    ('同學', '相處', '好', '難'), ('朋友', '相處', '好', '難'), ('新', '同學', '熱絡'),
    ('新', '同學', '說', '話'), ('新', '同學', '互動'), ('新', '同學', '搭話'),
    ('新', '朋友', '說話'), ('新', '朋友', '互動'), ('新', '朋友', '搭話'),
    ('同學', '互動'), ('同學', '搭話'), ('朋友', '說話'), ('朋友', '互動'), ('朋友', '搭話'),
    ('知道', '新', '同學', '相處'), ('新', '同學', '相處', '覺得', '不自在'), ('同學們', '混熟'),

    ]

pattern3 = [
    ('自我', '介紹', '怎辦'), ('自我', '介紹', '辦'),
    ('知道', '自我', '介紹'), ('自我', '介紹'),
    ('自我', '介紹', '緊張'), ('上台', '自我', '介紹'),
    ('不緊', '張', '自我', '介紹'), '方介紹', ('分享', '經歷')
    ]

pattern4 = [
    ('交到', '朋友'), '交朋友', ('結交新', '朋友'),
    ('變成', '朋友'), '朋友', ('認識', '同學'),
]

pattern5 = [
    ('分組', '害怕'), ('分組', '辦'), ('分組', '這件', '事'),
    ('某人', '一組'), '人一組',
]

pattern6 = [
    ('融入', '新團體'), ('融入', '新環境'),
    ('適合', '新', '環境', '開場'), ('找到', '屬', '朋友圈'),
    ('找到', '適合', '朋友'), ('找到', '知心', '好友')
]

pattern7 = [
    ('交友', '緊張'), ('同學', '講話', '緊張'), ('害怕', '同學', '說', '話'),
    ('消除', '交友', '緊', '張感')
]

pattern8 = [
    ('同學開', '玩笑'), ('想', '同學開', '玩笑'),('與剛', '認識', '打熟'),
    ('與剛', '認識', '混熟'), ('開', '過分', '玩笑', '辦'),
    ('開', '超過', '玩笑', '辦'), ('開', '太白', '目的', '玩笑', '辦'),
]

pattern9 = [
    ('氣氛', '尷尬', '辦'), ('化解', '尷尬'), ('知道', '化解', '尷尬'),
    ('尷尬', '辦'), '尷尬', ('現在', '氣氛', '尷尬'),
]

answers = ['或許你能和朋友聊聊校園間的趣事', '你可以先看看別人都在談論什麼話題，試著去參與',
           '放輕鬆，不要緊張，把台下的人當作石頭就好', '試著去和他人說話，不要害怕',
           '不要害怕去問別人', 'answer6', 'answer7', 'answer8', 'answer9',
           ]

chat = {
    '1':  pattern1, '2': pattern2, '3': pattern3, '4':  pattern4, '5': pattern5,
    '6': pattern6, '7':  pattern7, '8': pattern8, '9': pattern9,
}


def judgment(pattern, answer):
    d = 0
    for i in pattern:
        for j in reply:
            if j in i:
                d = d+1
        if d >= len(i):
            print(answer)
            count = 1
            return count
        else:
            d = 0


for key in chat:
    ans = judgment(chat[key], answers[int(key)-1])
    if ans == 1:
        break



