package tw.com.closer.data;

import tw.com.closer.R;

import java.util.ArrayList;

public class Common {
    // 卡片的圖片
    public static int pic[]={
            R.drawable.picture1,
            R.drawable.picture2,
            R.drawable.picture3
    };


    // 卡片的文字
    public static String textInfo[]={
            "微笑是全世界共通的語言，中國人也說：「伸手不打笑臉人」，這就是微笑的功用。帶著微笑與人談話帶有鼓勵意味，讓對方相信你很願意跟他交談，也會比較沒有談話壓力。如果你不知道怎麼與人聊天，很簡單，先給對方一個微笑，你就會發現開啟對話其實不難。即使你只是隨口說道：「今天天氣真好。」但若你面帶笑容，想必可以得到對方禮貌性的回應。即使是要拒絕他人，也可以用微笑來化解彼此之間的衝突。",
            "幾年來，幾乎所有的竹科企業我都去過了，和企業的人有所接觸後，我才知道我過去有「知識偏執」的狀況，但我並沒有真正認識30歲上下的職場工作人員。竹科有一家上市公司的員工平均年齡是31.8歲，他們都是最優秀大學畢業的菁英。 在開始工作的前10年，是人生很重要的階段，但他們卻通常是11點以後才下班。要戀愛，可能沒有時間戀愛；要買房子，就用世俗的固定模式買房子，找一個大家認為有名的設計師；要結婚，但用很草率的方式結婚。我知道很多工程師經由輔導去娶烏克蘭新娘，他們可能連戀愛的時間、耐心都沒有。",
            "我現在不問工程師有沒有去聽音樂、看展覽，反而是問他們：「你們在這裡工作5年了，有沒有人可以告訴我公司門口那一排是什麼樹？」但很少人能夠回答的出來。事實上，他們公司門口那排小葉欖仁的葉子漂亮得不得了，綠色會在陽光裡發亮。後來我再去，就有一個員工和我說，「謝謝你告訴我這件事，我現在下班時會先看看小葉欖仁再回家，所以比較不會和太太吵架了。」他也問我現在5歲的女兒將來該學鋼琴、還是小提琴，但我建議11點下班的他多抱抱女兒，比較重要。"
    };


    // 存放資料陣列
    public static ArrayList<Life> lives;
}
